--
-- PostgreSQL database dump
--

-- Dumped from database version 14.1
-- Dumped by pg_dump version 14.1

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

SET default_tablespace = '';

SET default_table_access_method = heap;

--
-- Name: catalog; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.catalog (
    id integer NOT NULL,
    name character(30),
    description text,
    price double precision
);


ALTER TABLE public.catalog OWNER TO postgres;

--
-- Name: catalog_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.catalog_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.catalog_id_seq OWNER TO postgres;

--
-- Name: catalog_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: postgres
--

ALTER SEQUENCE public.catalog_id_seq OWNED BY public.catalog.id;


--
-- Name: users; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.users (
    users_id integer NOT NULL,
    users_name text,
    users_login text,
    users_password text
);


ALTER TABLE public.users OWNER TO postgres;

--
-- Name: users_users_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.users_users_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.users_users_id_seq OWNER TO postgres;

--
-- Name: users_users_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: postgres
--

ALTER SEQUENCE public.users_users_id_seq OWNED BY public.users.users_id;


--
-- Name: catalog id; Type: DEFAULT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.catalog ALTER COLUMN id SET DEFAULT nextval('public.catalog_id_seq'::regclass);


--
-- Name: users users_id; Type: DEFAULT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.users ALTER COLUMN users_id SET DEFAULT nextval('public.users_users_id_seq'::regclass);


--
-- Data for Name: catalog; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.catalog (id, name, description, price) FROM stdin;
1	Товар 1                       	Описание Товара 1	1
2	Товар 2                       	Описание Товара 2	2
3	Товар 3                       	Описание Товара 3	3
4	Товар 4                       	Описание Товара 4	4
5	Товар 5                       	Описание Товара 5	5
6	Товар 6                       	Описание Товара 6	6
7	Товар 7                       	Описание Товара 7	7
8	Товар 8                       	Описание Товара 8	8
9	Товар 9                       	Описание Товара 9	9
10	Товар 10                      	Описание Товара 10	10
11	Товар 11                      	Описание Товара 11	11
12	Товар 12                      	Описание Товара 12	12
13	Товар 1                       	Описание Товара 1	1
14	Товар 2                       	Описание Товара 2	2
15	Товар 3                       	Описание Товара 3	3
16	Товар 4                       	Описание Товара 4	4
17	Товар 5                       	Описание Товара 5	5
18	Товар 6                       	Описание Товара 6	6
19	Товар 7                       	Описание Товара 7	7
20	Товар 8                       	Описание Товара 8	8
21	Товар 9                       	Описание Товара 9	9
22	Товар 10                      	Описание Товара 10	10
23	Товар 11                      	Описание Товара 11	11
24	Товар 12                      	Описание Товара 12	12
25	Товар 1                       	Описание Товара 1	1
26	Товар 2                       	Описание Товара 2	2
27	Товар 3                       	Описание Товара 3	3
28	Товар 4                       	Описание Товара 4	4
29	Товар 5                       	Описание Товара 5	5
30	Товар 6                       	Описание Товара 6	6
31	Товар 7                       	Описание Товара 7	7
32	Товар 8                       	Описание Товара 8	8
33	Товар 9                       	Описание Товара 9	9
34	Товар 10                      	Описание Товара 10	10
35	Товар 11                      	Описание Товара 11	11
36	Товар 12                      	Описание Товара 12	12
37	Товар 1                       	Описание Товара 1	1
38	Товар 2                       	Описание Товара 2	2
39	Товар 3                       	Описание Товара 3	3
40	Товар 4                       	Описание Товара 4	4
41	Товар 5                       	Описание Товара 5	5
42	Товар 6                       	Описание Товара 6	6
43	Товар 7                       	Описание Товара 7	7
44	Товар 8                       	Описание Товара 8	8
45	Товар 9                       	Описание Товара 9	9
46	Товар 10                      	Описание Товара 10	10
47	Товар 11                      	Описание Товара 11	11
48	Товар 12                      	Описание Товара 12	12
49	Товар 1                       	Описание Товара 1	1
50	Товар 2                       	Описание Товара 2	2
51	Товар 3                       	Описание Товара 3	3
52	Товар 4                       	Описание Товара 4	4
53	Товар 5                       	Описание Товара 5	5
54	Товар 6                       	Описание Товара 6	6
55	Товар 7                       	Описание Товара 7	7
56	Товар 8                       	Описание Товара 8	8
57	Товар 9                       	Описание Товара 9	9
58	Товар 10                      	Описание Товара 10	10
59	Товар 11                      	Описание Товара 11	11
60	Товар 12                      	Описание Товара 12	12
61	Товар 1                       	Описание Товара 1	1
62	Товар 2                       	Описание Товара 2	2
63	Товар 3                       	Описание Товара 3	3
64	Товар 4                       	Описание Товара 4	4
65	Товар 5                       	Описание Товара 5	5
66	Товар 6                       	Описание Товара 6	6
67	Товар 7                       	Описание Товара 7	7
68	Товар 8                       	Описание Товара 8	8
69	Товар 9                       	Описание Товара 9	9
70	Товар 10                      	Описание Товара 10	10
71	Товар 11                      	Описание Товара 11	11
72	Товар 12                      	Описание Товара 12	12
73	Товар 1                       	Описание Товара 1	1
74	Товар 2                       	Описание Товара 2	2
75	Товар 3                       	Описание Товара 3	3
76	Товар 4                       	Описание Товара 4	4
77	Товар 5                       	Описание Товара 5	5
78	Товар 6                       	Описание Товара 6	6
79	Товар 7                       	Описание Товара 7	7
80	Товар 8                       	Описание Товара 8	8
81	Товар 9                       	Описание Товара 9	9
82	Товар 10                      	Описание Товара 10	10
83	Товар 11                      	Описание Товара 11	11
84	Товар 12                      	Описание Товара 12	12
85	Товар 1                       	Описание Товара 1	1
86	Товар 2                       	Описание Товара 2	2
87	Товар 3                       	Описание Товара 3	3
88	Товар 4                       	Описание Товара 4	4
89	Товар 5                       	Описание Товара 5	5
90	Товар 6                       	Описание Товара 6	6
91	Товар 7                       	Описание Товара 7	7
92	Товар 8                       	Описание Товара 8	8
93	Товар 9                       	Описание Товара 9	9
94	Товар 10                      	Описание Товара 10	10
95	Товар 11                      	Описание Товара 11	11
96	Товар 12                      	Описание Товара 12	12
97	Товар 1                       	Описание Товара 1	1
98	Товар 2                       	Описание Товара 2	2
99	Товар 3                       	Описание Товара 3	3
100	Товар 4                       	Описание Товара 4	4
101	Товар 5                       	Описание Товара 5	5
102	Товар 6                       	Описание Товара 6	6
103	Товар 7                       	Описание Товара 7	7
104	Товар 8                       	Описание Товара 8	8
105	Товар 9                       	Описание Товара 9	9
106	Товар 10                      	Описание Товара 10	10
107	Товар 11                      	Описание Товара 11	11
108	Товар 12                      	Описание Товара 12	12
109	Товар 1                       	Описание Товара 1	1
110	Товар 2                       	Описание Товара 2	2
111	Товар 3                       	Описание Товара 3	3
112	Товар 4                       	Описание Товара 4	4
113	Товар 5                       	Описание Товара 5	5
114	Товар 6                       	Описание Товара 6	6
115	Товар 7                       	Описание Товара 7	7
116	Товар 8                       	Описание Товара 8	8
117	Товар 9                       	Описание Товара 9	9
118	Товар 10                      	Описание Товара 10	10
119	Товар 11                      	Описание Товара 11	11
120	Товар 12                      	Описание Товара 12	12
121	Товар 1                       	Описание Товара 1	1
122	Товар 2                       	Описание Товара 2	2
123	Товар 3                       	Описание Товара 3	3
124	Товар 4                       	Описание Товара 4	4
125	Товар 5                       	Описание Товара 5	5
126	Товар 6                       	Описание Товара 6	6
127	Товар 7                       	Описание Товара 7	7
128	Товар 8                       	Описание Товара 8	8
129	Товар 9                       	Описание Товара 9	9
130	Товар 10                      	Описание Товара 10	10
131	Товар 11                      	Описание Товара 11	11
132	Товар 12                      	Описание Товара 12	12
133	Товар 1                       	Описание Товара 1	1
134	Товар 2                       	Описание Товара 2	2
135	Товар 3                       	Описание Товара 3	3
136	Товар 4                       	Описание Товара 4	4
137	Товар 5                       	Описание Товара 5	5
138	Товар 6                       	Описание Товара 6	6
139	Товар 7                       	Описание Товара 7	7
140	Товар 8                       	Описание Товара 8	8
141	Товар 9                       	Описание Товара 9	9
142	Товар 10                      	Описание Товара 10	10
143	Товар 11                      	Описание Товара 11	11
144	Товар 12                      	Описание Товара 12	12
145	Товар 1                       	Описание Товара 1	1
146	Товар 2                       	Описание Товара 2	2
147	Товар 3                       	Описание Товара 3	3
148	Товар 4                       	Описание Товара 4	4
149	Товар 5                       	Описание Товара 5	5
150	Товар 6                       	Описание Товара 6	6
151	Товар 7                       	Описание Товара 7	7
152	Товар 8                       	Описание Товара 8	8
153	Товар 9                       	Описание Товара 9	9
154	Товар 10                      	Описание Товара 10	10
155	Товар 11                      	Описание Товара 11	11
156	Товар 12                      	Описание Товара 12	12
157	Товар 1                       	Описание Товара 1	1
158	Товар 2                       	Описание Товара 2	2
159	Товар 3                       	Описание Товара 3	3
160	Товар 4                       	Описание Товара 4	4
161	Товар 5                       	Описание Товара 5	5
162	Товар 6                       	Описание Товара 6	6
163	Товар 7                       	Описание Товара 7	7
164	Товар 8                       	Описание Товара 8	8
165	Товар 9                       	Описание Товара 9	9
166	Товар 10                      	Описание Товара 10	10
167	Товар 11                      	Описание Товара 11	11
168	Товар 12                      	Описание Товара 12	12
169	Товар 1                       	Описание Товара 1	1
170	Товар 2                       	Описание Товара 2	2
171	Товар 3                       	Описание Товара 3	3
172	Товар 4                       	Описание Товара 4	4
173	Товар 5                       	Описание Товара 5	5
174	Товар 6                       	Описание Товара 6	6
175	Товар 7                       	Описание Товара 7	7
176	Товар 8                       	Описание Товара 8	8
177	Товар 9                       	Описание Товара 9	9
178	Товар 10                      	Описание Товара 10	10
179	Товар 11                      	Описание Товара 11	11
180	Товар 12                      	Описание Товара 12	12
181	Товар 1                       	Описание Товара 1	1
182	Товар 2                       	Описание Товара 2	2
183	Товар 3                       	Описание Товара 3	3
184	Товар 4                       	Описание Товара 4	4
185	Товар 5                       	Описание Товара 5	5
186	Товар 6                       	Описание Товара 6	6
187	Товар 7                       	Описание Товара 7	7
188	Товар 8                       	Описание Товара 8	8
189	Товар 9                       	Описание Товара 9	9
190	Товар 10                      	Описание Товара 10	10
191	Товар 11                      	Описание Товара 11	11
192	Товар 12                      	Описание Товара 12	12
193	Товар 1                       	Описание Товара 1	1
194	Товар 2                       	Описание Товара 2	2
195	Товар 3                       	Описание Товара 3	3
196	Товар 4                       	Описание Товара 4	4
197	Товар 5                       	Описание Товара 5	5
198	Товар 6                       	Описание Товара 6	6
199	Товар 7                       	Описание Товара 7	7
200	Товар 8                       	Описание Товара 8	8
201	Товар 9                       	Описание Товара 9	9
202	Товар 10                      	Описание Товара 10	10
203	Товар 11                      	Описание Товара 11	11
204	Товар 12                      	Описание Товара 12	12
205	Товар 1                       	Описание Товара 1	1
206	Товар 2                       	Описание Товара 2	2
207	Товар 3                       	Описание Товара 3	3
208	Товар 4                       	Описание Товара 4	4
209	Товар 5                       	Описание Товара 5	5
210	Товар 6                       	Описание Товара 6	6
211	Товар 7                       	Описание Товара 7	7
212	Товар 8                       	Описание Товара 8	8
213	Товар 9                       	Описание Товара 9	9
214	Товар 10                      	Описание Товара 10	10
215	Товар 11                      	Описание Товара 11	11
216	Товар 12                      	Описание Товара 12	12
217	Товар 1                       	Описание Товара 1	1
218	Товар 2                       	Описание Товара 2	2
219	Товар 3                       	Описание Товара 3	3
220	Товар 4                       	Описание Товара 4	4
221	Товар 5                       	Описание Товара 5	5
222	Товар 6                       	Описание Товара 6	6
223	Товар 7                       	Описание Товара 7	7
224	Товар 8                       	Описание Товара 8	8
225	Товар 9                       	Описание Товара 9	9
226	Товар 10                      	Описание Товара 10	10
227	Товар 11                      	Описание Товара 11	11
228	Товар 12                      	Описание Товара 12	12
229	Товар 1                       	Описание Товара 1	1
230	Товар 2                       	Описание Товара 2	2
231	Товар 3                       	Описание Товара 3	3
232	Товар 4                       	Описание Товара 4	4
233	Товар 5                       	Описание Товара 5	5
234	Товар 6                       	Описание Товара 6	6
235	Товар 7                       	Описание Товара 7	7
236	Товар 8                       	Описание Товара 8	8
237	Товар 9                       	Описание Товара 9	9
238	Товар 10                      	Описание Товара 10	10
239	Товар 11                      	Описание Товара 11	11
240	Товар 12                      	Описание Товара 12	12
241	Товар 1                       	Описание Товара 1	1
242	Товар 2                       	Описание Товара 2	2
243	Товар 3                       	Описание Товара 3	3
244	Товар 4                       	Описание Товара 4	4
245	Товар 5                       	Описание Товара 5	5
246	Товар 6                       	Описание Товара 6	6
247	Товар 7                       	Описание Товара 7	7
248	Товар 8                       	Описание Товара 8	8
249	Товар 9                       	Описание Товара 9	9
250	Товар 10                      	Описание Товара 10	10
251	Товар 11                      	Описание Товара 11	11
252	Товар 12                      	Описание Товара 12	12
253	Товар 1                       	Описание Товара 1	1
254	Товар 2                       	Описание Товара 2	2
255	Товар 3                       	Описание Товара 3	3
256	Товар 4                       	Описание Товара 4	4
257	Товар 5                       	Описание Товара 5	5
258	Товар 6                       	Описание Товара 6	6
259	Товар 7                       	Описание Товара 7	7
260	Товар 8                       	Описание Товара 8	8
261	Товар 9                       	Описание Товара 9	9
262	Товар 10                      	Описание Товара 10	10
263	Товар 11                      	Описание Товара 11	11
264	Товар 12                      	Описание Товара 12	12
265	Товар 1                       	Описание Товара 1	1
266	Товар 2                       	Описание Товара 2	2
267	Товар 3                       	Описание Товара 3	3
268	Товар 4                       	Описание Товара 4	4
269	Товар 5                       	Описание Товара 5	5
270	Товар 6                       	Описание Товара 6	6
271	Товар 7                       	Описание Товара 7	7
272	Товар 8                       	Описание Товара 8	8
273	Товар 9                       	Описание Товара 9	9
274	Товар 10                      	Описание Товара 10	10
275	Товар 11                      	Описание Товара 11	11
276	Товар 12                      	Описание Товара 12	12
\.


--
-- Data for Name: users; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.users (users_id, users_name, users_login, users_password) FROM stdin;
\.


--
-- Name: catalog_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.catalog_id_seq', 276, true);


--
-- Name: users_users_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.users_users_id_seq', 1, false);


--
-- Name: catalog catalog_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.catalog
    ADD CONSTRAINT catalog_pkey PRIMARY KEY (id);


--
-- Name: users users_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.users
    ADD CONSTRAINT users_pkey PRIMARY KEY (users_id);


--
-- PostgreSQL database dump complete
--

